import img from "../../img/Ourmsg/project3.jpg";
import OurMsgBox from "./OurMsgBox";
const OurMsg = () => {
  let desc1 = `مهمتنا هي تحقيق رضا العملاء من خلال تحقيق أعلى مستوى من الخدمات عالية الجودة بأسعار عادلة  ، كل ذلك بسبب الوقت المخطط والمراقب الذي تم تأريخه من قبل العميل.
    عمل قائم على القيمة لجميع أصحاب المصلحة لدينا نهج فريق واحد لتنفيذ المشروع مع جميع عملائنا
    تنفيذ المشاريع بأحدث الحلول الهندسية والتكنولوجية
    أعلى مستوى من الصحة والسلامة والجودة والاستدامة في جميع مشاريعنا وأقسامنا.
    توفير "النمو من خلال التعلم" لجميع موظفيها والسماح لفرقنا بالتطور والازدهار من خلال التعليم والتدريب.
    أنشطة الأعمال المستدامة التي تستخدم أحدث التقنيات والإدارة مع الفوائد المشتركة ليس فقط أثناء البناء ولكن أيضًا أثناء دورة حياة المبنى.
    تحقيق مكانة نموذج الأعمال التجارية من خلال مستويات عالية من الاحتراف والالتزام بالجودة والسلامة والصحة والبيئة لكل من عملائنا وموظفينا.
    `;

  return (
    <div className="py-[100px]">
      <OurMsgBox desc={desc1} img={img} msg="رسالتنا" btn={true} />
    </div>
  );
};

export default OurMsg;
