import Ser1 from "../Components/ServicesComponent/Ser1";
import img1 from "../Components/../img/servicesImg/s1.png";
import img2 from "../Components/../img/servicesImg/s2.png";
import img3 from "../Components/../img/servicesImg/s3.png";
import img4 from "../Components/../img/servicesImg/s4.png";
import Ser2 from "../Components/ServicesComponent/Ser2";
import Navbar from "../Components/InAll/Navbar";
import Mode from "../Components/InAll/Mode";
import Arrow from "../Components/InAll/Arrow";
import Footer from "../Components/InAll/Footer";

const Services = () => {
  let desc1 = `تقوم الشركة بتقديم استشارات متخصصة للعملاء في مجال البناء. تساعدهم في وضع خطط متكاملة وتصميمات مبتكرة تلبي احتياجاتهم وتحقق أهدافهم المحددة.
  تتولى الشركة إدارة جميع جوانب المشروع بالكامل. تنسق الأعمال والجداول الزمنية وتتابع التقدم وتوفر تحكمًا فعالًا في التكاليف والموارد لضمان تنفيذ المشروع بنجاح.
  تقوم الشركة بتنفيذ عمليات البناء بدقة وجودة عالية. تعتمد على فرق عمل مؤهلة ومهنية وتستخدم مواد بناء عالية الجودة لضمان المتانة والاستدامة.
  `;
  let desc2 = `
  يشمل ذلك مدير المشروع الذي يتولى التخطيط الاستراتيجي وتنسيق العمليات واتخاذ القرارات الحاسمة. بالإضافة إلى ذلك، يوجد فريق إداري يتولى مراقبة التكاليف وإدارة المخاطر والجودة، وكذلك فريق مهندسين وفنيين يقومون بإعداد التصميمات وإشراف على تنفيذ الأعمال وضمان جودتها.
  تشمل مهام إدارة البناء أيضًا التواصل المستمر مع العملاء والموردين والمقاولين الفرعيين. تسهم هذه الاتصالات في توفير تواصل فعال وفهم واضح لمتطلبات العميل وتوقعاتة
  `;
  let desc3 = `
  تتطلب الانشاءات العامة مهارات متخصصة وخبرة في مجالات متعددة. يتعين على المهندسين المدنيين والمعماريين والفنيين العمل بتنسيق وثقة لتحقيق التصاميم المطلوبة وتنفيذ المشاريع 
 . بشكل صحيح وكل هذا تجده في شركتنا
بدءًا من التخطيط والتصميم الهندسي وحتى تنفيذ الأعمال الانشائية الفعلية يقوم مشرفونا بمتابعه العمال جيدا للخروج باكمل وجه للمشروع.
  `;

  let desc4 = `تتضمن خدماتنا تصميم وتخطيط المشاريع، وإدارة المشاريع، وتنفيذ الأعمال الإنشائية، وإدارة الجودة والمراقبة، والصيانة والتشغيل. نحن نعمل على تقديم حلول شاملة لعملائنا، بدءًا من مرحلة التخطيط وحتى التسليم النهائي للمشروع.
  تتميز شركتنا بالتفاني والتفهم العميق لاحتياجات العملاء. نحن نعمل على تحقيق رؤية العميل وتنفيذ مشاريعهم بدقة وفقًا للمواصفات المطلوبة. نحن نعتبر كل مشروع فرصة لإظهار قدراتنا والتفوق في تقديم الحلول المبتكرة والمستدامة.


  `;

  return (
    <>
      <Navbar />
      <Mode />
      <Arrow />
      <div>
        <Ser1 desc={desc1} title={"خدمات البناء"} img={img1} />
      </div>
      <div className="ser2">
        <Ser2 desc={desc2} title={"ادارة البناء"} img={img2} />
      </div>
      <div className="py-[150px]">
        <Ser1 desc={desc3} title={"انشاءات عامة"} img={img3} />
      </div>
      <div className="ser2">
        <Ser2 desc={desc4} title={"تصميم البناء"} img={img4} />
      </div>
      <Footer />
    </>
  );
};

export default Services;
