export let dataOftype = [
  "سباك",
  "محاره",
  "كهربائي",
  "رخام",
  "الومنيوم",
  "زجاج",
  "كريتال",
  "سقاله",
  "تكسير",
  "عادي",
  "بنا",
];
// export let nameOfMowardeen = ["حديد عز", "محمد اسمنت", "ابو هاشم"];
export let TypeOfMowardeen = ["حداده", "سباكة", "نقاشه", "نجاره", "كهرباء"];
// export let nameOfEquip = ["محمد", "صاصا", "علي"];
export let TypeOfEquips = [
  "جليدر",
  "لودر",
  "حفار",
  "هراس",
  "عربية مياه",
  "سياره نقل كبيره",
  "سياره خدمه نص نقل",
];
export let AllnamesByRole = [
  "كريم يونس",
  "عادل سيد احمد",
  "حسين محمد ابراهيم",
  "أحمد ابراهيم محمد",
  "ميسره صبحي",
  "محمد الشافعي",
  "عبدالستار بورسعيد",
  "محمد سامح",
  "محمد السيد",
  "نادر الطيب",
  "اسلام سعيد",
  "أحمد خالد",
  "كريم مجدي",
  "محمد فتحي",
  "اسامه سويس",
];
