export let dataOftype = ["مبلط", "ممحر", "نقاش", "نجار"];
export let nameOfMowardeen = ["حديد عز", "محمد اسمنت", "ابو هاشم"];
export let TypeOfMowardeen = ["حداده", "سباكة", "نقاشه"];
export let nameOfEquip = ["محمد", "صاصا", "علي"];
export let TypeOfEquips = ["كراك", "دكاك", "جرار"];
export let AllnamesByRole = [
  "كريم يونس",
  "عادل سيد احمد",
  "حسين محمد ابراهيم",
  "أحمد ابراهيم محمد",
  "ميسره صبحي",
  "محمد الشافعي",
  "عبدالستار بورسعيد",
  "محمد سامح",
  "محمد السيد",
  "نادر الطيب",
  "اسلام سعيد",
  "أحمد خالد",
  "كريم مجدي",
  "محمد فتحي",
  "اسامه سويس",
];
